# 내장함수 이론
# 파이썬 인터프리터에는 항상 사용할 수 있는 많은 함수가 준비되어 있음.
# 내장함수 정보 : https://docs.python.org/3/
# abs() 함수 : 숫자의 절대값을 반환하는 데 사용, 정수 및 부동 소수점 수를 포함하여 모든 수에 적용가능
# all() 함수 : 시퀀스(리스트나 딕셔너리)를 받아서, 모든 항목이 참이면 True 를 반환한다.
# any() 함수 : 시퀀스 객체에서 한개의 항목이라도 참인 경우 True 를 반환.
# bin() 함수 : 정수의 이진 표현을 반환. 항상 접두사 0b 로 시작한다.
# eval() 함수 : 전달된 수식을 구문 분석하고 프로그램 내에서 수식을 계산한다.
# list() 함수 : 리스트를 생성하는 함수

# ---------------------------------------------------------
# 내장함수 이론2
# dir() : 객체가 가지고 있는 변수가 함수를 보여준다.
# filter() : 특정 조건을 만족하는 요소만을 뽑는다.